Revit 2026 API

# CompoundStructureGetExtendableRegionIds Method

---

Gets the extendable region ids for the compound structure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> GetExtendableRegionIds(
	bool top
)
```
```vb
Public Function GetExtendableRegionIds (
	top As Boolean
) As IList(Of Integer)
```
```cpp
public:
IList<int>^ GetExtendableRegionIds(
	bool top
)
```
```fsharp
member GetExtendableRegionIds :
        top : bool -> IList<int>
```

#### Parameters

top Boolean
     If true, retrieve ids of regions which are extendable at the top, otherwise retrieve the ids of regions which are extendable at the bottom.

#### Return Value

IListInt32 An array of region ids which are marked extendable.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

Regions along the top or bottom of the wall may be set to be extendable.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace